app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    if params[:sort_by].to_s == 'title'
      @sort_by_movie_title = 'hilite'
      @movies = Movie.all.order(params[:sort_by])