app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13')  ORDER BY "movies"."release_date" ASC
---
  def index
  @path = 'PATH_INFO'
    if request.env[@path] == '/'
      session.clear
    end

    @allratings = Movie.all_ratings
    showRatings = session[:ratings_to_show].nil?
    queryParamsByRating = params[:ratings]

    ratings = queryParamsByRating.nil? ? (showRatings  ? @allratings : JSON.parse(session[:ratings_to_show])) : queryParamsByRating.keys

    @queryParam = params[:sort_by]
    @querySession = session[:sort_by]

    if @queryParam
      @querySession = @queryParam
      sort = @queryParam
    elsif @querySession
      sort = @querySession
    end


    @ratings_to_show = ratings

    if sort == "title"
      @movies = Movie.with_ratings(ratings).order(:title)
      session[:sort_by] = 'title'

    elsif sort == "release_date"
      @movies = Movie.with_ratings(ratings).order(:release_date)